In [1]:
#installed xlrd (Nice.)
import pandas as pd

Import table and sections from Excel
Excel sheet 07.10 conversion and wrangling = "Trip Characteristics"

In [2]:
df= pd.read_excel("section07.xls", sheet_name="07.10")
print(df)

                             Unnamed: 0    Unnamed: 1    Unnamed: 2  \
0                                   NaN           NaN           NaN
1                                   NaN           NaN           NaN
2                                   NaN           NaN           NaN
3                                   NaN           NaN           NaN
4                                   NaN           NaN           NaN
5                                   NaN           NaN           NaN
6                                   NaN           NaN           NaN
7                                   NaN           NaN           NaN
8                                   NaN           NaN           NaN
9                       All visitors 1/  2.065689e+06  6.656779e+06
10                                  NaN           NaN           NaN
11                  Purpose of visit 1/           NaN           NaN
12                       Pleasure (net)  1.585412e+06  5.734311e+06
13                             Vacation  1.537844e+06  5.515116e+06
14                            Honeymoon  4.746113e+04  2.338577e+05
15                  Wedding/Get Married  1.430059e+04  4.534982e+04
16  Meetings, conventions, incentive 1/  9.937194e+04  9.538994e+04
17                Convention/conference  6.325789e+04  4.306084e+04
18                    Corporate meeting  2.147340e+04  2.817941e+04
19                            Incentive  1.790867e+04  2.782640e+04
20                       Other business  9.564378e+04  1.432338e+05
21           Visit friends or relatives  3.149518e+05  8.232686e+05
22               Government or military  3.497155e+04  5.663027e+04
23                        Attend school  6.972997e+03  1.499786e+04
24                          Sport event  1.364241e+04  1.833693e+04
25                                  NaN           NaN           NaN
26                      Traveler method           NaN           NaN
27                           Group tour  4.010146e+04  8.351203e+04
28                              Package  2.425189e+05  9.192191e+05
29                     True independent  1.805154e+06  5.694152e+06
30                                  NaN           NaN           NaN
31                       Accommodations           NaN           NaN
32                                Hotel  9.733389e+05  3.461805e+06
33                           Hotel only  8.181045e+05  3.010088e+06
34                                Condo  3.695491e+05  1.286219e+06
35                           Condo only  2.994723e+05  1.057556e+06
36                            Timeshare  1.882075e+05  6.757413e+05
37                       Timeshare only  1.491365e+05  5.566026e+05
38                         Rental house  2.560914e+05  7.979448e+05
39                               Hostel  1.676442e+04  3.261810e+04
40                            Camp site  1.679986e+04  3.256271e+04
41                      Bed & breakfast  2.735834e+04  6.709277e+04
42                          Cruise ship  2.192602e+04  1.723226e+03
43                   Friends, relatives  3.431115e+05  7.959866e+05

       Unnamed: 3     Unnamed: 4
0             NaN            NaN
1             NaN            NaN
2             NaN            NaN
3             NaN            NaN
4             NaN            NaN
5             NaN            NaN
6             NaN            NaN
7             NaN            NaN
8             NaN            NaN
9        612384.0  120981.000000
10            NaN            NaN
11            NaN            NaN
12  535053.683588   97479.808440
13  493663.237684   92525.661922
14    41520.12573    5031.331542
15    6238.264466     523.977561
16   33069.673806    1853.243024
17   14589.942349     559.668598
18    2922.741449     703.019068
19   16189.623401     624.318168
20    3869.829622    1856.115196
21   25984.270631   14045.000654
22    1966.249914    2980.238670
23    1781.713841     721.719024
24    3279.050518     524.447429
25            NaN            NaN
26            NaN            NaN
27           (NA)    1269.353199
28           (NA)    9615.254535
29           (NA)  110736.352381
30            NaN            NaN
31            NaN            NaN
32  441040.954235   56871.777872
33  397682.842822   50205.465155
34  106933.791697   31549.390794
35   78340.136083   27229.893869
36   29539.361331    9229.778090
37   21556.965541    7342.589221
38    33250.26952    7778.792477
39    3633.115736    1197.613877
40    3251.838926     817.025767
41    6229.677459     542.133851
42    2711.776703     106.911099
43   31259.561674   18756.936990

Looking to see how data was imported and what wrangling needs to be done

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 44 entries, 0 to 43
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  32 non-null     object
 1   Unnamed: 1  29 non-null     float64
 2   Unnamed: 2  29 non-null     float64
 3   Unnamed: 3  29 non-null     object
 4   Unnamed: 4  29 non-null     float64
dtypes: float64(3), object(2)
memory usage: 1.8+ KB

Need to drop empty cells
Need to rename columns

In [4]:
deduped_df = df.dropna()
deduped_df.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4
9,All visitors 1/,2.065689e+06,6.656779e+06,612384.0,120981.000000
12,Pleasure (net),1.585412e+06,5.734311e+06,535053.683588,97479.808440
13,Vacation,1.537844e+06,5.515116e+06,493663.237684,92525.661922
14,Honeymoon,4.746113e+04,2.338577e+05,41520.12573,5031.331542
15,Wedding/Get Married,1.430059e+04,4.534982e+04,6238.264466,523.977561

Rename columns

In [5]:
renamed_df = deduped_df.rename(
    columns = {
    "Unnamed: 0": "Subject", 
    "Unnamed: 1": "Domestic 2020-1",
    "Unnamed: 2": "Domestic 2021-1", 
    "Unnamed: 3": "International 2020-1", 
    "Unnamed: 4": "International 2021-1"})
renamed_df.head()

,Subject,Domestic 2020-1,Domestic 2021-1,International 2020-1,International 2021-1
9,All visitors 1/,2.065689e+06,6.656779e+06,612384.0,120981.000000
12,Pleasure (net),1.585412e+06,5.734311e+06,535053.683588,97479.808440
13,Vacation,1.537844e+06,5.515116e+06,493663.237684,92525.661922
14,Honeymoon,4.746113e+04,2.338577e+05,41520.12573,5031.331542
15,Wedding/Get Married,1.430059e+04,4.534982e+04,6238.264466,523.977561

Excel sheet 07.07 conversion and wrangling = "Visitor arrivals, by area visted"

In [6]:
df_2= pd.read_excel("section07.xls", sheet_name="07.07")
print(df_2)

         Unnamed: 0      Unnamed: 1      Unnamed: 2      Unnamed: 3  \
0               NaN             NaN             NaN             NaN
1               NaN             NaN             NaN             NaN
2               NaN             NaN             NaN             NaN
3               NaN             NaN             NaN             NaN
4               NaN             NaN             NaN             NaN
5               NaN             NaN            2020             NaN
6      Area visited           Total        Domestic  Inter-national
7               NaN             NaN             NaN             NaN
8      State total   2678072.861446  2065688.861462        612384.0
9               NaN             NaN             NaN             NaN
10             Oahu  1506315.659653   998148.523944   508167.135718
11            Kauai   330262.667066   295842.755924    34419.911142
12      Maui County   807308.419573   706498.581754    100809.83782
13             Maui   792601.693654   693197.320885    99404.372769
14          Molokai    17024.986222    12998.553311     4026.432911
15            Lanai    17924.022199     15488.98345     2435.038749
16    Hawaii Island   493817.021415   402529.632083    91287.389332
17             Hilo   155032.741515   124359.793354    30672.948161
18             Kona   433193.992245   352567.633874    80626.358371
19  One island only  2311925.464449  1797842.149784   514083.314663
20        Oahu only  1212897.032808   794044.115331   418852.917476

        Unnamed: 4      Unnamed: 5      Unnamed: 6
0              NaN             NaN             NaN
1              NaN             NaN             NaN
2              NaN             NaN             NaN
3              NaN             NaN             NaN
4              NaN             NaN             NaN
5              NaN            2021             NaN
6            Total        Domestic  Inter-national
7              NaN             NaN             NaN
8   6777760.263237  6656779.263237        120981.0
9              NaN             NaN             NaN
10  3326622.092527  3250595.675265    76026.417262
11    813647.31792   807657.817604     5989.500316
12  2340914.931979  2298907.580889    42007.351091
13  2303941.517542  2262136.950777    41804.566766
14    25758.390803    25507.857103        250.5337
15     47829.24513    47290.640173      538.604956
16  1183457.998357  1172729.105042    10728.893315
17   293832.711127   291467.398143     2365.312984
18  1064571.439433   1054542.74088    10028.698553
19  5990063.982128   5880593.10609   109470.876038
20  2737924.661345  2671018.357009    66906.304337

Drop dupes

In [7]:

deduped_df_2 = df_2.dropna()
deduped_df_2.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
6,Area visited,Total,Domestic,Inter-national,Total,Domestic,Inter-national
8,State total,2678072.861446,2065688.861462,612384.0,6777760.263237,6656779.263237,120981.0
10,Oahu,1506315.659653,998148.523944,508167.135718,3326622.092527,3250595.675265,76026.417262
11,Kauai,330262.667066,295842.755924,34419.911142,813647.31792,807657.817604,5989.500316
12,Maui County,807308.419573,706498.581754,100809.83782,2340914.931979,2298907.580889,42007.351091

Rename columns

In [8]:
renamed_df_2 = deduped_df_2.rename(
    columns = {
    "Unnamed: 0": "Area Visited", 
    "Unnamed: 1": "Total 2020",
    "Unnamed: 2": "Domestic 2020-2", 
    "Unnamed: 3": "International 2020-2", 
    "Unnamed: 4": "Total 2021",
    "Unnamed: 5": "Domestic 2021-2",
    "Unnamed: 6": "International 2021-2"}) 
renamed_df_2.head()

,Area Visited,Total 2020,Domestic 2020-2,International 2020-2,Total 2021,Domestic 2021-2,International 2021-2
6,Area visited,Total,Domestic,Inter-national,Total,Domestic,Inter-national
8,State total,2678072.861446,2065688.861462,612384.0,6777760.263237,6656779.263237,120981.0
10,Oahu,1506315.659653,998148.523944,508167.135718,3326622.092527,3250595.675265,76026.417262
11,Kauai,330262.667066,295842.755924,34419.911142,813647.31792,807657.817604,5989.500316
12,Maui County,807308.419573,706498.581754,100809.83782,2340914.931979,2298907.580889,42007.351091

In [9]:
dropped_df_2 = renamed_df_2.drop([6])
dropped_df_2.head()

,Area Visited,Total 2020,Domestic 2020-2,International 2020-2,Total 2021,Domestic 2021-2,International 2021-2
8,State total,2678072.861446,2065688.861462,612384.0,6777760.263237,6656779.263237,120981.0
10,Oahu,1506315.659653,998148.523944,508167.135718,3326622.092527,3250595.675265,76026.417262
11,Kauai,330262.667066,295842.755924,34419.911142,813647.31792,807657.817604,5989.500316
12,Maui County,807308.419573,706498.581754,100809.83782,2340914.931979,2298907.580889,42007.351091
13,Maui,792601.693654,693197.320885,99404.372769,2303941.517542,2262136.950777,41804.566766

convert to CSV

In [10]:
renamed_df.to_csv('stats.csv',encoding = "utf-8")
renamed_df_2.to_csv('stats_table2.csv', encoding = "utf-8")